In [1]:
from utils.dbmanager import DBManager
from utils.agent import SQLAgent
from dotenv import load_dotenv
load_dotenv()

True

In [2]:
manager = DBManager()

Environment variables loaded successfully!
Connected to the database!

In [3]:
manager.write_query("DROP TABLE IF EXISTS Employees")

In [4]:
manager.write_query("CREATE TABLE Employees (Name VARCHAR(255), Salary INT, Department VARCHAR(255))")
manager.write_query("INSERT INTO Employees (Name, Salary, Department) VALUES ('John Doe', 50000, 'Accounting')")
manager.write_query("INSERT INTO Employees (Name, Salary, Department) VALUES ('Jane Doe', 60000, 'Accounting')")

In [5]:
manager.read_query("SELECT * FROM Employees")

       Name  Salary  Department
0  John Doe   50000  Accounting
1  Jane Doe   60000  Accounting

In [6]:
from langchain_groq import ChatGroq
model = ChatGroq(model="llama3-8b-8192")

In [7]:
agent = SQLAgent(model, manager)

In [8]:
agent.get_result("Add employee Vyankatesh with salary 200090 in department Accounting")

AgentResponse(query_mode='write', query="INSERT INTO employees (Name, Salary, Department) VALUES ('Vyankatesh', 200090, 'Accounting')", query_output=None, agent_output='The employee Vyankatesh with salary 200090 has been successfully added to the Accounting department.')

In [9]:
agent.latest_result

QueryResult(type='write', query="INSERT INTO employees (Name, Salary, Department) VALUES ('Vyankatesh', 200090, 'Accounting')", result=None)

In [10]:
agent.get_result("Retrieve all unique names of employees having department of Accounting")

AgentResponse(query_mode='read', query="SELECT DISTINCT Name FROM employees WHERE Department='Accounting'", query_output=         Name
0    John Doe
1    Jane Doe
2  Vyankatesh, agent_output='The employees having the department of Accounting are John Doe, Jane Doe, and Vyankatesh.')

In [11]:
agent.get_result_without_agent("SELECT * FROM Employes")

AgentResponse(query_mode='error', query='SELECT * FROM Employes', query_output=None, agent_output='The mistake in the query is that the table name "Employes" is spelled incorrectly. The actual table name is "employees" in lowercase.\n\nThe corrected query would be:\n\n```\nSELECT * FROM employees\n```\n\nThe SQL query is trying to select all columns (`*`) from the "employees" table, but it\'s using a different spelling for the table name, which is causing the error.')